music_app/app/models/user.rb

  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "-JKTAZdmDatVQ4leFl-krQ"], ["updated_at", "2018-11-16 00:28:42.883081"], ["id", 1]]