music_app/app/views/albums/show.html.erb

<h1> <%= @album.title %></h1>
<h2>By <%= (Band.find_by(id: @album.band_id).name) %></h2>
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]