music_app/app/controllers/albums_controller.rb

  def new
    @bands = Band.all
---
SELECT "bands".* FROM "bands"

  def create
    album = Album.new(album_params)

    @band = Band.find_by(id: params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" IS NULL LIMIT $1  [["LIMIT", 1]]