music_app/app/controllers/bands_controller.rb

  def create
    band = Band.new(band_params)

    if band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "The Goo Goo Dolls"], ["created_at", "2018-11-15 22:09:28.419024"], ["updated_at", "2018-11-15 22:09:28.419024"]]

  def update
    band = Band.find_by(id: params[:id])

    if band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Linkin Parker"], ["updated_at", "2018-11-15 22:45:58.012068"], ["id", 1]]

  def destroy
    band = Band.find_by(id: params[:id])
    Band.delete(band)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]